IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULADORA.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
77 NUM1	PIC 9(05)V99.
77 NUM2	PIC 9(05)V99.
77 RESULTADO	PIC 9(05)V99.

PROCEDURE DIVISION.
	DISPLAY "CALCULADORA".
	DISPLAY "DAME EL NUMERO 1: ".
	ACCEPT NUM1.
	DISPLAY "DAME EL NUMERO 2: ".
	ACCEPT NUM2.
	ADD NUM1 TO NUM2 GIVING RESULTADO.
	DISPLAY RESULTADO.
STOP RUN.