IDENTIFICATION DIVISION.
PROGRAM-ID. CALCULADORA.

ENVIRONMENT DIVISION.

DATA DIVISION.
LINKAGE SECTION.
77 NUM1	PIC S9(05)V99.
WORKING-STORAGE SECTION.
77 NUM2	PIC S9(05)V99.
77 RESULTADO	PIC 9(05)V99.
77 OPCION	PIC A(01).

PROCEDURE DIVISION.
	DISPLAY "CALCULADORA".
	DISPLAY "DAME EL NUMERO 1: ".
	ACCEPT NUM1 FROM ARGVALUE.
	DISPLAY "DAME EL NUMERO 2: ".
	ACCEPT NUM2.
	DISPLAY "INDICA LA OPERACION A REALIZAR: S = SUMA, R = RESTA, M = MULTIPLICACION, D = DIVISION".
	ACCEPT OPCION.
	IF OPCION = "S" THEN
		ADD NUM1 TO NUM2 GIVING RESULTADO
		DISPLAY RESULTADO.
	IF OPCION = "R" THEN
		SUBTRACT NUM1 FROM NUM2 GIVING RESULTADO
		DISPLAY RESULTADO.
	IF OPCION = "M" THEN
		MULTIPLY NUM1 BY NUM2 GIVING RESULTADO
		DISPLAY RESULTADO.
	IF OPCION = "D" THEN
		DIVIDE NUM1 INTO NUM2 GIVING RESULTADO
		DISPLAY RESULTADO.
STOP RUN.