IDENTIFICATION DIVISION.
PROGRAM-ID. Java_hello_calculator.

DATA DIVISION.

WORKING-STORAGE SECTION.
77 NUM1	PIC S9(05)V99.
77 NUM2	PIC S9(05)V99.
77 RESULTADO	PIC 9(05)V99.
77 OPERACION	PIC A(01).

PROCEDURE DIVISION.
	ACCEPT NUM1 FROM ARGUMENT-VALUE.
	ACCEPT NUM2 FROM ARGUMENT-VALUE.
	ACCEPT OPERACION FROM ARGUMENT-VALUE.
	IF OPERACION = "a" THEN
		ADD NUM1 TO NUM2 GIVING RESULTADO
		DISPLAY RESULTADO
	END-IF.
	IF OPERACION = "m" THEN
		SUBTRACT NUM1 FROM NUM2 GIVING RESULTADO
		DISPLAY RESULTADO
	END-IF.
	IF OPERACION = "M" THEN
		MULTIPLY NUM1 BY NUM2 GIVING RESULTADO
		DISPLAY RESULTADO
	END-IF.
	IF OPERACION = "d" THEN
		DIVIDE NUM1 INTO NUM2 GIVING RESULTADO
		DISPLAY RESULTADO
	END-IF.
STOP RUN.